# ----------------------------------------------------------
# --------------------------------------------
# ------------------------------------
# -----------------------------
# --------------------                          -დავალება-
# -----------                                                                
# ----                             :)
# --
#                                             -    --------   -
#  -----------------------------       -- 20 შეცდომა და შესწორებები --
#                                             -    --------   -

#  --
#  -----
#  --------
#  --------------
#  -------------------------
#  --------------------------------
#  ------------------------------------------
#  -------------------------------------------------------

# 1...
#  print("hello')
#  როცა ბრჭყალებით ვიწყებთ წერას, ტოველთვის ისევ იგივე ბრჭყალით უნდა დასრულდეს ტექსტი
#  print("hello")


# 2...
#  print(hello)
#  ეს შეცდომა არის რადგან არ შეიძლება ბრჭყალების გარეშე დაწერა
#  print("hello")


# 3...
#  print "this is an obvious mistake"
#  არ შეიძლება ბრჭყალების გარეშე პრინტის დაწერა
#  print("this is an obvious mistake")


# 4...
#  print("mistake"
#  როცა პრინტს ვწერთ ყოველთვის დამხურავი ფრჩხილით უნდა დავხუროთ წინადადება/რასაც ვწერთ
#  print("mistake")


# 5...
#  print('hello this| is a mistake')
#  როცა '-ით ვწერთ გრძელ წინადადებას პითონს ჰგონია რომ ორი სიტყვის შემდეგ სრულდება წინადადება და ქმნის ერორს
#  print("hello this is a mistake")


# 6...
#  variable - "hello"
#  არ შეიძლება -ის დაწერა =-ის ნაცვლად
#  variable = "hello"


#  7...
#   variable = hello
#   როცა ცვლადის მნიშვნელობას ვწერთ ბრჭყალებში უნდა ჩავსვათ რომ შეცდომა არ იყოს
#   variable = "hello"


#  8...
#   variable="hello"
#   არ შეილება ტოლობის ნიშანი დაშორების გარეშე დავწეროთ
#   variable = "hello"
  

#  9...
#   print(variable)
#   variable = "hello"
#   არ შეიძლება პრინტის დაწერა ცვლადის დაწერამდე
#   variable = "hello"
#   print(variable)


  
#  10...
#   print[car]
#   პრინტის გამოყენების დროს ყოველთის ფრჩხილებს ვიყენებთ


#  11...
#   print(name)
#   ცვლადს ვერ გამოვიძახებთ თუ ნიშვნელობა არ მივეცით
#   name = "barbare"
#   print(name)


#  12... მთავარი შეცდომა
#   print("hello")
#   ახალ ხაზზე ტექსტი ყოველთვის შეწეული უნდა იყოს


#  13...
#   პრინტ("ჰელლო")
#   არ შეიძლება სხვა ენაზე კოდის დაწერა
#   print("ჰელლო")


#  14...
#   name = "barbare"
#   surname = "diasamidze"
#   age = 10
#   print( (name) + (surname) + (age) )
#   როცა print ის დროს ინტეგერის ცვლადი უნდა დავამატოთ სტრინგი უნდა გამოვიყენოთ
#   print( (name) + (surname) + str (age) )



#  15...
#   name ====== "barbare"
#   არ შეიძლება ზედმეტი ნიშნების დაწერა
#   name = "barbare"


#  16...
#   print(((((("hello"))))))
#   არ შეიძლება ზედმეტი ნიშნების დაწერა
#   print("hello")


#  17...
#   print(7+++++7)
#   არ შეიძლება ზედმეტი ნიშნების დაწერა
#   print( 7 + 7 )



#  18...
#   print( 5 ***** 5 )
#   არ შეიძლება ზედმეტი ნიშნების დაწერა
#   print( 5 * 5 )


#  19...
#   print(10/////////////2)
#   არ შეიძლება ზედმეტი ნიშნების დაწერა
#   print(10/2)



#  20...
#   print( 4----2 )
#   არ შეიძლება ზედმეტი ნიშნების დაწერა
#   print( 4-2 )



   


    
   
 

  
  
  

  