points = int(input(" enter your points : "))

if points >= 90:
    print("თქვენ დაგიფინანსდებათ სწავლა სრულიად.")

elif points <= 100:
    print("თქვენ დაგიფინანსდებათ სწავლა სრულიად.")

elif points >= 70:
    print("თქვენ დაგიფინანსდებათ სწავლა 1500 ლარით")

elif points <= 80:
    print("თქვენ დაგიფინანსდებათ სწავლა 1500 ლარით")

elif points >= 40:
    print("თქვენ დაგიფინანსდებათ სწავლა 500 ლარტით")

elif points <= 70:
    print("თქვენ დაგიფინანსდებათ სწავლა 500 ლარტით")

else:
    print("თქვენ არ დაგიფინანსდებათ სწავლის პროცესი")

